{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-NUM",
    "2": "I-NUM",
    "3": "B-STR",
    "4": "I-STR",
    "5": "B-WDS",
    "6": "I-WDS",
    "7": "B-DST",
    "8": "I-DST",
    "9": "B-PRO",
    "10": "I-PRO",
    "11": "B-NHB",
    "12": "I-NHB",
    "13": "B-BLD",
    "14": "I-BLD",
    "15": "B-POI",
    "16": "I-POI",
    "17": "B-FLR",
    "18": "I-FLR",
    "19": "B-RM",
    "20": "I-RM"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BLD": 13,
    "B-DST": 7,
    "B-FLR": 17,
    "B-NHB": 11,
    "B-NUM": 1,
    "B-POI": 15,
    "B-PRO": 9,
    "B-RM": 19,
    "B-STR": 3,
    "B-WDS": 5,
    "I-BLD": 14,
    "I-DST": 8,
    "I-FLR": 18,
    "I-NHB": 12,
    "I-NUM": 2,
    "I-POI": 16,
    "I-PRO": 10,
    "I-RM": 20,
    "I-STR": 4,
    "I-WDS": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
